In [2]:
import pandas as pd

scores = {"name": ["Ray", "Japhy", "Zosa"], "city": ["San Francisco", "San Francisco", "Denver"], "score": [75, 92, 94]}
df = pd.DataFrame(scores)
df

    name           city  score
0    Ray  San Francisco     75
1  Japhy  San Francisco     92
2   Zosa         Denver     94

In [5]:
df['score'] == df.score # either or
df.score

0    75
1    92
2    94
Name: score, dtype: int64

In [9]:
df['name_city'] = df['name']

In [10]:
df['score']>90 # like in R
df[df['score']>90]

    name           city  score name_city
1  Japhy  San Francisco     92     Japhy
2   Zosa         Denver     94      Zosa